erp3l.Доработка/src/Documents/ПроизводствоБезЗаказа/ПроизводствоБезЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="402a4f63-c632-4b91-9a24-a8b41c330ff0">
  <name>ПроизводствоБезЗаказа</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e24bb256-c251-481f-ab6a-001937a7fbac">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="624a9efd-8819-47bb-8f59-7181512915b4">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fe822e0b-ce9b-4846-927e-0614e1cbf955">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="52f55d7e-cb0f-4623-af5a-37ed8162fe91">
    <name>ПобочныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="45f3fec6-28ee-4eaf-97e5-7dad198de9f6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="9c018d82-1947-4ce8-87fb-d0203e254132">
    <name>МатериалыИРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ff9b928f-979a-4318-9af7-df49c20a3a05">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l.Доработка/src/Documents/ПроизводствоБезЗаказа/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ллл_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПроизводствоБезЗаказа.Ссылка,
		|	ПроизводствоБезЗаказа.ПометкаУдаления,
		|	ПроизводствоБезЗаказа.Номер,
		|	ПроизводствоБезЗаказа.Дата,
		|	 ПроизводствоБезЗаказа.ллл_Сделка,
		|	 ПроизводствоБезЗаказа.ллл_КодРС,
		|	 ПроизводствоБезЗаказа.ллл_Номер,
		|	ПроизводствоБезЗаказа.Проведен,
		|	ПроизводствоБезЗаказа.Организация,
		|	ПроизводствоБезЗаказа.Подразделение,
		|	ПроизводствоБезЗаказа.ГруппировкаЗатрат,
		|	ПроизводствоБезЗаказа.ВыпускПодДеятельность,
		|	ПроизводствоБезЗаказа.НаправлениеДеятельности,
		|	ПроизводствоБезЗаказа.ВидЦены,
		|	ПроизводствоБезЗаказа.Ответственный,
		|	ПроизводствоБезЗаказа.Комментарий,
		|	ПроизводствоБезЗаказа.ВидыЗапасовУказаныВручную,
		|	ПроизводствоБезЗаказа.Валюта,
		|	ПроизводствоБезЗаказа.ЕстьМаркируемаяПродукцияГИСМ,
		|	ПроизводствоБезЗаказа.РаспоряжениеДляТрудозатрат,
		|	ПроизводствоБезЗаказа.МаксимальныйКодСтрокиВыходныеИзделия,
		|	ПроизводствоБезЗаказа.МаксимальныйКодСтрокиТрудозатраты,
		|	ПроизводствоБезЗаказа.СпособРаспределенияЗатратНаВыходныеИзделия,
		|	ПроизводствоБезЗаказа.ВыходныеИзделия.*,
		|	ПроизводствоБезЗаказа.ВыходныеИзделияСерии.*,
		|	ПроизводствоБезЗаказа.ПобочныеИзделия.*,
		|	ПроизводствоБезЗаказа.ПобочныеИзделияСерии.*,
		|	ПроизводствоБезЗаказа.МатериалыИРаботы.*,
		|	ПроизводствоБезЗаказа.Трудозатраты.*,
		|	ПроизводствоБезЗаказа.ДополнительныеРеквизиты.*,
		|	ПроизводствоБезЗаказа.ВидыЗапасовМатериалыИРаботы.*,
		|	ПроизводствоБезЗаказа.ВидыЗапасовВыходныеИзделия.*,
		|	ПроизводствоБезЗаказа.ВидыЗапасовПобочныеИзделия.*,
		|	ПроизводствоБезЗаказа.МоментВремени,
		|	СостоянияЭД.СостояниеЭДО,
		|	СостоянияЭД.ПредставлениеСостояния,
		|	ПроизводствоБезЗаказа.Автор
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
		|		ПО (СостоянияЭД.СсылкаНаОбъект = ПроизводствоБезЗаказа.Ссылка)";
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	// вывод добавленного реквизита
	ПолеВвода = Элементы.Вставить("Сделка", Тип("ПолеФормы"), Элементы.Список, Элементы.ГруппировкаЗатрат);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Список.ллл_Сделка";
	
	// вывод добавленного реквизита
	ПолеВвода = Элементы.Вставить("ллл_КодРС", Тип("ПолеФормы"), Элементы.Список, Элементы.ГруппировкаЗатрат);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Список.ллл_КодРС";
	
	// вывод добавленного реквизита
	ПолеВвода = Элементы.Вставить("ллл_Номер", Тип("ПолеФормы"), Элементы.Список, Элементы.ГруппировкаЗатрат);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Список.ллл_Номер";
	
	// вывод реквизита
	ПолеВвода = Элементы.Вставить("Подразделение", Тип("ПолеФормы"), Элементы.Список, Элементы["Сделка"]);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Список.Подразделение";
	
	// скрыть реквизит
	Элементы.ПредставлениеСостояния.Видимость=Ложь;
	Элементы.НаправлениеДеятельности.Видимость=Ложь;
	Элементы.ГруппировкаЗатрат.Видимость=Ложь;
	
КонецПроцедуры
